mlyszczek/nuttx/arch/arm/include/stm32f0l0/chip.h
#elif defined(CONFIG_ARCH_CHIP_STM32F091CB) || defined(CONFIG_ARCH_CHIP_STM32F091CC)

#  ifdef CONFIG_ARCH_CHIP_STM32F091CB
#    define STM32_FLASH_SIZE    (128*1024) /* 128Kb */
#  else
#    define STM32_FLASH_SIZE    (256*1024) /* 256Kb */
#  endif
#  define STM32_SRAM_SIZE       (32*1024)  /*  32Kb */

#  define STM32_NATIM           1  /* One advanced timer TIM1 */
#  define STM32_NGTIM16         5  /* 16-bit general up/down timers TIM3, TIM14-17 */
#  define STM32_NGTIM32         1  /* 32-bit general up/down timers TIM2 */
#  define STM32_NBTIM           2  /* 2 basic timers: TIM6, TIM7 */
#  define STM32_NSPI            2  /* Two SPI modules (SPI or I2S) */
#  define STM32_NI2S            2  /* Two I2S modules (SPI or I2S) */
#  define STM32_NI2C            2  /* Two I2C modules */
#  define STM32_NUSART          6  /* Six USARTs modules */
#  define STM32_NCAN            1  /* One CAN controller */
#  define STM32_NUSBDEV         0  /* No USB device controller */
#  define STM32_NCEC            1  /* One HDMI-CEC controller */
#  define STM32_NADC12          1  /* One 12-bit module */
#  define STM32_NADCCHAN        10 /* 10 external channels */
#  define STM32_NADCINT         3  /* Three internal channels */
#  define STM32_NDAC            1  /* One DAC module */
#  define STM32_NDACCHAN        2  /* Two DAC channels */
#  define STM32_NCOMP           2  /* Two Analog Comparators */
#  define STM32_NCAP            17 /* Capacitive sensing channels */
#  define STM32_NPORTS          6  /* Six GPIO ports, GPIOA-F */

#elif defined(CONFIG_ARCH_CHIP_STM32F091RB) || defined(CONFIG_ARCH_CHIP_STM32F091RC) \
   || defined(CONFIG_ARCH_CHIP_STM32F091VB) || defined(CONFIG_ARCH_CHIP_STM32F091VC)

#  if defined(CONFIG_ARCH_CHIP_STM32F091RB) || defined(CONFIG_ARCH_CHIP_STM32F091VB)
#    define STM32_FLASH_SIZE    (128*1024) /* 128Kb */
#  else
#    define STM32_FLASH_SIZE    (256*1024) /* 256Kb */
#  endif
#  define STM32_SRAM_SIZE       (32*1024)  /*  32Kb */

#  define STM32_NATIM           1  /* One advanced timer TIM1 */
#  define STM32_NGTIM16         5  /* 16-bit general up/down timers TIM3, TIM14-17 */
#  define STM32_NGTIM32         1  /* 32-bit general up/down timers TIM2 */
#  define STM32_NBTIM           2  /* 2 basic timers: TIM6, TIM7 */
#  define STM32_NSPI            2  /* Two SPI modules (SPI or I2S) */
#  define STM32_NI2S            2  /* Two I2S modules (SPI or I2S) */
#  define STM32_NI2C            2  /* Two I2C modules */
#  define STM32_NUSART          8  /* Eight USARTs modules */
#  define STM32_NCAN            1  /* One CAN controller */
#  define STM32_NUSBDEV         0  /* No USB device controller */
#  define STM32_NCEC            1  /* One HDMI-CEC controller */
#  define STM32_NADC12          1  /* One 12-bit module */
#  define STM32_NADCCHAN        16 /* 16 external channels */
#  define STM32_NADCINT         3  /* Three internal channels */
#  define STM32_NDAC            1  /* One DAC module */
#  define STM32_NDACCHAN        2  /* Two DAC channels */
#  define STM32_NCOMP           2  /* Two Analog Comparators */
#  if defined(CONFIG_ARCH_CHIP_STM32F091VB) || defined(CONFIG_ARCH_CHIP_STM32F091VC)
#    define STM32_NCAP          24 /* Capacitive sensing channels */
#  else
#    define STM32_NCAP          18 /* Capacitive sensing channels */
#  endif
#  define STM32_NPORTS          6  /* Six GPIO ports, GPIOA-F */

/* STM32L EnergyLite Line ***********************************************************/
 
/* STM32L03XX  - With LCD
 * STM32L02XX  - No LCD
 *
 * STM32L0XXX8 - 64KB FLASH, 20KB SRAM, 3KB EEPROM
 * STM32L0XXXB - 128KB FLASH, 20KB SRAM, 6KB EEPROM
 * STM32L0XXXZ - 192KB FLASH, 20KB SRAM, 3KB EEPROM
 *
 * STM32L0XXCX - 48-pins
 * STM32L0XXRX - 64-pins
 * STM32L0XXVX - 100-pins
 */

#############################################################################################################
#if defined(CONFIG_ARCH_CHIP_STM32L072V8) || defined(CONFIG_ARCH_CHIP_STM32L072VB) || \
    defined(CONFIG_ARCH_CHIP_STM32L072VZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     2   /* (2) SPI1-2 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     0   /* No LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    84  /* (84) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                24  /* (24) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

############################################################################################################
#elif defined(CONFIG_ARCH_CHIP_STM32L072KB) || defined(CONFIG_ARCH_CHIP_STM32L072KZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     1   /* (1) SPI1 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     0   /* No LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    25  /* (25) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                13  /* (13) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

#############################################################################################################
#elif defined(CONFIG_ARCH_CHIP_STM32L072CB) || defined(CONFIG_ARCH_CHIP_STM32L072CZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     2   /* (2) SPI1-2 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     0   /* No LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    40  /* (40) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                19  /* (19) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

#############################################################################################################
#elif defined(CONFIG_ARCH_CHIP_STM32L072RB) || defined(CONFIG_ARCH_CHIP_STM32L072RZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     2   /* (2) SPI1-2 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     0   /* No LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    51  /* (51) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                24  /* (24) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

#############################################################################################################
#elif defined(CONFIG_ARCH_CHIP_STM32L073V8) || defined(CONFIG_ARCH_CHIP_STM32L073VB) || \
      defined(CONFIG_ARCH_CHIP_STM32L073VZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     2   /* (2) SPI1-2 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     1   /* (1) LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    84  /* (84) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                24  /* (24) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

#############################################################################################################
#elif defined(CONFIG_ARCH_CHIP_STM32L073CB) || defined(CONFIG_ARCH_CHIP_STM32L073CZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     2   /* (2) SPI1-2 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     1   /* LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    37  /* (37) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                17  /* (17) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

#############################################################################################################
#elif defined(CONFIG_ARCH_CHIP_STM32L073RB) || defined(CONFIG_ARCH_CHIP_STM32L073RZ)
#  define STM32_NFSMC                    0   /* No FSMC */
#  define STM32_NATIM                    0   /* No advanced timers */
#  define STM32_NGTIM                    2   /* (2) 16-bit general up/down timers TIM2-3 with DMA */
#  define STM32_NGTIMNDMA                2   /* (2) 16-bit general timers TIM21-22 without DMA */
#  define STM32_NBTIM                    2   /* (2) Basic timers: TIM6, TIM7 with DMA */
                                             /* (1) LPTIMER */
#  define STM32_NDMA                     1   /* (1) DMA1, 7-channels */
#  define STM32_NSPI                     2   /* (2) SPI1-2 */
#  define STM32_NI2S                     1   /* (1) I2S */
#  define STM32_NUSART                   4   /* (4) USART1-4 */
                                             /* (1) LPUART */
#  define STM32_NI2C                     3   /* (1) I2C1-2 */
#  define STM32_NCAN                     0   /* No CAN */
#  define STM32_NSDIO                    0   /* No SDIO */
#  define STM32_NLCD                     1   /* LCD */
#  define STM32_NUSBOTG                  1   /* (1) USB OTG FS/HS (only USB 2.0 device) */
#  define STM32_NGPIO                    51  /* (51) GPIOA-E,H */
#  define STM32_NADC                     1   /* (1) ADC1, 14-channels */
#  define STM32_NDAC                     2   /* (2) DAC 1-2, 2 channels */
#  define STM32_NCMP                     2   /* (2) Comparators */
#  define STM32_NCAPSENSE                24  /* (24) Capacitive sensing channels */
#  define STM32_NCRC                     1   /* CRC */
#  define STM32_NETHERNET                0   /* No Ethernet */
#  define STM32_NRNG                     1   /* Random number generator (RNG) */
#  define STM32_NDCMI                    0   /* No digital camera interface (DCMI) */

#############################################################################################################
#else
#  error "Unsupported STM32F0xx chip"
#endif

/* NVIC priority levels *************************************************************/
/* Each priority field holds a priority value, 0-31. The lower the value, the greater
 * the priority of the corresponding interrupt. The processor implements only
 * bits[7:6] of each field, bits[5:0] read as zero and ignore writes.
 */

#define NVIC_SYSH_PRIORITY_MIN     0xc0 /* All bits[7:6] set is minimum priority */
#define NVIC_SYSH_PRIORITY_DEFAULT 0x80 /* Midpoint is the default */
#define NVIC_SYSH_PRIORITY_MAX     0x00 /* Zero is maximum priority */
#define NVIC_SYSH_PRIORITY_STEP    0x40 /* Two bits of interrupt priority used */

/************************************************************************************
 * Public Types
 ************************************************************************************/

/************************************************************************************
 * Public Data
 ************************************************************************************/

/************************************************************************************
 * Public Functions
 ************************************************************************************/

#endif /* __ARCH_ARM_INCLUDE_STM32F0L0_CHIP_H */
